aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx13t/r_s12ad_rx13t.c
    /* DO UNIVERSAL PARAMETER CHECKING */
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
    if (unit > 0)
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* Pointer check */
    if ((NULL == p_args) || (FIT_NO_PTR == p_args))
    {
        if ((ADC_CMD_SET_DDA_STATE_CNT == cmd)
        || (ADC_CMD_SET_SAMPLE_STATE_CNT == cmd)
        || (ADC_CMD_ENABLE_CHANS == cmd))
        {
            return ADC_ERR_MISSING_PTR;
        }
    }
#endif

    /* PROCESS INDIVIDUAL COMMANDS */
    switch (cmd)
    {
        case ADC_CMD_SET_DDA_STATE_CNT:

            /* Disconnection Detection Assist (DDA) */
            p_charge = (adc_dda_t *)p_args;
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
            if (ADC_DDA_OFF != p_charge->method)
            {
                if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
                || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX)
                || (0 != p_regs->ADCER.BIT.DIAGM)          // self-diagnosis enabled
                || ((p_regs->ADEXICR.WORD & 0x0200) != 0))  // sensors enabled
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
#endif
            if (ADC_DDA_OFF == p_charge->method)
            {
                p_regs->ADDISCR.BYTE = 0;
            }
            else
            {

                /* NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time */
                p_regs->ADDISCR.BYTE = (uint8_t)((ADC_DDA_PRECHARGE == p_charge->method) ? 0x10 : 0);
                p_regs->ADDISCR.BYTE |= p_charge->num_states;
            }
            break;

        case ADC_CMD_SET_SAMPLE_STATE_CNT:

            /* sampling state */
            p_sample = (adc_sst_t *)p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if ((p_sample->reg_id > ADC_SST_REG_MAX)
            || (p_sample->num_states < ADC_SST_CNT_MIN))
            {
                return ADC_ERR_INVALID_ARG;
            }
#endif
            *(gp_sreg_ptrs)[p_sample->reg_id] = p_sample->num_states;
            break;

        case ADC_CMD_ENABLE_CHANS:

            /* Specifies the A/D conversion channel. */
            err = adc_configure_scan(unit, (adc_ch_cfg_t *)p_args);
            break;

        case ADC_CMD_ENABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 1;           // enable sync/async triggers
            break;

        case ADC_CMD_DISABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 0;           // disable sync/async triggers
            break;

        case ADC_CMD_SCAN_NOW:
            if (0 == p_regs->ADCSR.BIT.ADST)
            {
                p_regs->ADCSR.BIT.ADST = 1;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE:           // default/Group A or Group B
            if (1 == p_regs->ADCSR.BIT.ADST)
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPA:

            /* interrupt flag */
            if (1 == IR(S12AD,S12ADI))
            {

                /* clear interrupt flag */
                IR(S12AD,S12ADI) = 0;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPB:

            /* interrupt flag */
            if (1 == IR(S12AD,GBADI))
            {

                /* clear interrupt flag */
                IR(S12AD,GBADI) = 0;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPC:

            /* interrupt flag */
            if (1 == IR(S12AD,GCADI))
            {

                /* clear interrupt flag */
                IR(S12AD,GCADI) = 0;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_ENABLE_INT:
            p_regs->ADCSR.BIT.ADIE = 1;           // enable S12ADI0 interrupt
            break;

        case ADC_CMD_DISABLE_INT:
            p_regs->ADCSR.BIT.ADIE = 0;           // disable S12ADI0 interrupt
            break;

        case ADC_CMD_ENABLE_INT_GROUPB:
            p_regs->ADCSR.BIT.GBADIE = 1;         // enable GBADI interrupt
            break;

        case ADC_CMD_DISABLE_INT_GROUPB:
            p_regs->ADCSR.BIT.GBADIE = 0;         // disable GBADI interrupt
            break;

        case ADC_CMD_ENABLE_INT_GROUPC:
            p_regs->ADGCTRGR.BIT.GCADIE = 1;      // enable GCADI interrupt
            break;

        case ADC_CMD_DISABLE_INT_GROUPC:
            p_regs->ADGCTRGR.BIT.GCADIE = 0;      // disable GCADI interrupt
            break;

        default:
            err = ADC_ERR_INVALID_ARG;
            break;
    }

    return err;
} /* End of function adc_control() */




/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{
    uint16_t    i=0;
    uint32_t    tmp_mask=0;

    /* A/D register address */
    aregs_t     *p_regs = (aregs_t *)&S12AD;
    uint16_t    trig_a;
    uint16_t    trig_b;
    uint16_t    trig_c;
    uint16_t    tmp_adpgacr;
    uint16_t    tmp_adpgags0;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* parameter checking */

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x00FF);

    adc_configure_sensors(p_config);

    /* NOTE: S&H adds to scan time because normal state machine still runs. */
    S12AD.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;

    /* adds 12 + sample_hold_states ADCLKS to scan time */
    S12AD.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;

    /* Programmable Gain Amplifier setting */
    tmp_adpgacr = 0x9999;
    tmp_adpgacr |= p_config->pga_amp[0];
    tmp_adpgacr |= (p_config->pga_amp[1] << 4);
    tmp_adpgacr |= (p_config->pga_amp[2] << 8);
    p_regs->ADPGACR.WORD = tmp_adpgacr;

    /* Operation stabilization wait time(5us) */
    R_BSP_SoftwareDelay((uint32_t)(5+1), BSP_DELAY_MICROSECS);

    tmp_adpgags0 = 0x0000;
    tmp_adpgags0 |= (p_config->pga_gain[0]);
    tmp_adpgags0 |= (p_config->pga_gain[1] << 4);
    tmp_adpgags0 |= (p_config->pga_gain[2] << 8);
    p_regs->ADPGAGS0.WORD = tmp_adpgags0;

    /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */

    if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
    {
        trig_a = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
        trig_b = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
        trig_c = p_regs->ADGCTRGR.BIT.TRSC;             // save TRSC
        p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
        p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
        p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
        {
            R_BSP_NOP();
        }

