aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_s12ad_rx/src/targets/rx13t/r_s12ad_rx13t.c
    /* unit == 0 */
    INTERNAL_NOT_USED(unit);

    /* clear flag */
    IR(S12AD,GBADI) = 0;

    /* enable in peripheral */
    S12AD.ADCSR.BIT.GBADIE = 1;

    /* not interrupt disabled */
    if (0 != IPR(S12AD,GBADI))
    {
        R_BSP_InterruptRequestEnable(VECT(S12AD,GBADI));       /* enable in ICU */
    }

} /* End of function adc_enable_s12gbadi() */


/******************************************************************************
* Function Name: adc_enable_s12gcadi
* Description  : This function clears the S12GCADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gcadi(uint8_t unit)
{

    /* unit == 0 */
    INTERNAL_NOT_USED(unit);

    /* clear flag */
    IR(S12AD,GCADI) = 0;

    /* enable in peripheral */
    S12AD.ADGCTRGR.BIT.GCADIE = 1;

    /* not interrupt disabled */
    if (0 != IPR(S12AD,GCADI))
    {
        R_BSP_InterruptRequestEnable(VECT(S12AD,GCADI));       /* enable in ICU */
    }

} /* End of function adc_enable_s12gcadi() */


/******************************************************************************
* Function Name: adc_close
* Description  : This is implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : ADC_SUCCESS - Successful
*                ADC_ERR_INVALID_ARG - unit contains an invalid value.
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{

    /* A/D register address */
    aregs_t     *p_regs = (aregs_t *)&S12AD;
    volatile    uint8_t i;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif


#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 0)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    /* Stop triggers & conversions, and disable peripheral interrupts */
    R_BSP_InterruptRequestDisable(VECT(S12AD,S12ADI));         // disable interrupts in ICU
    R_BSP_InterruptRequestDisable(VECT(S12AD,GBADI));       // disable interrupts in ICU
    R_BSP_InterruptRequestDisable(VECT(S12AD,GCADI));       // disable interrupts in ICU

    /* clear interrupt flag */
    IPR(S12AD,S12ADI) = 0;

    /* clear interrupt flag */
    IPR(S12AD,GBADI) = 0;

    /* clear interrupt flag */
    IPR(S12AD,GCADI) = 0;

    if (1 == p_regs->ADGSPCR.BIT.PGS)
    {
        p_regs->ADGSPCR.BIT.PGS = 0;
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        p_regs->ADSTRGR.WORD = 0x3F3F;
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            p_regs->ADGCTRGR.BIT.TRSC = 0x3F;
            p_regs->ADGCTRGR.BIT.GCADIE = 0;
        }
    }
    else
    {
        p_regs->ADSTRGR.BIT.TRSA = 0x3F;
    }

    p_regs->ADCSR.WORD = 0;
    if (0 != p_regs->ADCSR.WORD)
    {

        /* Dommy read and compare */
        R_BSP_NOP();
    }

    /* Wait for three clock cycles of ADCLK before entering the module stop mode */
    /* WAIT_LOOP */
    for (i = 0; i < 192; i++)
    {
        R_BSP_NOP();
    }

    /* clear interrupt flag */
    IR(S12AD,S12ADI) = 0;

    /* clear interrupt flag */
    IR(S12AD,GBADI) = 0;

    /* clear interrupt flag */
    IR(S12AD,GCADI) = 0;

    /* Power down peripheral */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    /* S12A module clock is enabled */
    MSTP(S12AD) = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */
    g_dcb.opened = false;

    return ADC_SUCCESS;
} /* End of function adc_close() */

/******************************************************************************
* Function Name: adc_read_all
* Description  : This is implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH0]  = S12AD.ADDR0;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH1]  = S12AD.ADDR1;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH2]  = S12AD.ADDR2;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH3]  = S12AD.ADDR3;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH4]  = S12AD.ADDR4;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH5]  = S12AD.ADDR5;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH6]  = S12AD.ADDR6;

    /* Read A/D conversion result */
    p_all_data->unit0.chan[ADC_REG_CH7]  = S12AD.ADDR7;

    /* Read A/D conversion result */
    p_all_data->unit0.volt               = S12AD.ADOCDR;

    /* Read A/D conversion result */
    p_all_data->unit0.dbltrig            = S12AD.ADDBLDR;

    /* Read A/D conversion result */
    p_all_data->unit0.dbltrigA           = S12AD.ADDBLDRA;

    /* Read A / D conversion result */
    p_all_data->unit0.dbltrigB           = S12AD.ADDBLDRB;

    /* Read A / D conversion result */
    p_all_data->unit0.self_diag          = S12AD.ADRD;

